Tekla Open API Reference for Tekla Structures 2025
Operation.Combine Method (Beam, Beam)
 Combines two beams into one beam.
 Namespace: Tekla.Structures.Model.Operations
 Assembly: Tekla.Structures.Model (in Tekla.Structures.Model.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public static Beam Combine(
	Beam ObjectToCombineTo,
	Beam ObjectToBeCombined
)
Public Shared Function Combine (
	ObjectToCombineTo As Beam,
	ObjectToBeCombined As Beam
) As Beam
Parameters
ObjectToCombineTo
Type: Tekla.Structures.Model.Beam
The beam to be combined to.
ObjectToBeCombined
Type: Tekla.Structures.Model.Beam
The beam which will be deleted after a successful operation.
Return Value
Type: Beam
The combined beam on success, null on failure.
See Also
Reference
Operation Class
Combine Overload
Tekla.Structures.Model.Operations Namespace